In [1]:
import pandas as pd

# DataFrame 基本處理
## 建立

In [2]:
df = pd.DataFrame({'cid':['c01','c02','c03','c04','c05'], 'time_spent':[2,34,91,203,763]})
df

   cid  time_spent
0  c01           2
1  c02          34
2  c03          91
3  c04         203
4  c05         763

In [3]:
df2 = pd.DataFrame([{'cid':'c01','num_spent':2}, {'cid':'c02','num_spent':34}])
df2

   cid  num_spent
0  c01          2
1  c02         34

# 取值

In [4]:
df['time_spent']

0      2
1     34
2     91
3    203
4    763
Name: time_spent, dtype: int64

In [5]:
df.time_spent

0      2
1     34
2     91
3    203
4    763
Name: time_spent, dtype: int64

In [6]:
df[['cid','time_spent']]

   cid  time_spent
0  c01           2
1  c02          34
2  c03          91
3  c04         203
4  c05         763

In [7]:
df[0:2]

   cid  time_spent
0  c01           2
1  c02          34

In [8]:
df[df['time_spent']>50]

   cid  time_spent
2  c03          91
3  c04         203
4  c05         763

# 新增

In [9]:
df['num_products'] = [2,3,4,1,6]
df

   cid  time_spent  num_products
0  c01           2             2
1  c02          34             3
2  c03          91             4
3  c04         203             1
4  c05         763             6

In [10]:
df = df.append(pd.DataFrame([{'cid': 'c06', 'time_spent':3,'num_products':4}]))
df

   cid  num_products  time_spent
0  c01             2           2
1  c02             3          34
2  c03             4          91
3  c04             1         203
4  c05             6         763
0  c06             4           3

In [11]:
df = df.reset_index(drop=True)
df

   cid  num_products  time_spent
0  c01             2           2
1  c02             3          34
2  c03             4          91
3  c04             1         203
4  c05             6         763
5  c06             4           3

In [12]:
df = df.rename(columns={'cid':'pid','num_products':'num_purchase'})
df

   pid  num_purchase  time_spent
0  c01             2           2
1  c02             3          34
2  c03             4          91
3  c04             1         203
4  c05             6         763
5  c06             4           3

In [13]:
df[0:1] = pd.DataFrame([{'pid':'c07','num_purchase':93,'time_spent':23}])
df

   pid  num_purchase  time_spent
0  c07            93          23
1  c02             3          34
2  c03             4          91
3  c04             1         203
4  c05             6         763
5  c06             4           3

# 刪除

In [14]:
del df['pid']
df

   num_purchase  time_spent
0            93          23
1             3          34
2             4          91
3             1         203
4             6         763
5             4           3

In [15]:
df = df.drop('time_spent', axis=1) #axis=1 is column

In [16]:
df

   num_purchase
0            93
1             3
2             4
3             1
4             6
5             4

In [17]:
df = df.drop([0,2,3])
df

   num_purchase
1             3
4             6
5             4

In [18]:
df = df.reset_index(drop=True)
df

   num_purchase
0             3
1             6
2             4